# To change this template, choose Tools | Templates
# and open the template in the editor.
descripcion1=\nUn arbre ABC (Arbre Binari Complet), \u00e9s un arbre que es caracteritza perque tot els seus nodes,\n excepte els del \u00faltim nivell tenen dos fills: \n \n - El subarbre esquerre, on hi s\u00f3n les claus m\u00e9s petitas que l'arrel.\n \n  El subarbre dret,on hi s\u00f3n les claus m\u00e9s grans que l'arrel.
descripcion2=\nEls arbres AVL (Adelson-Velskii y Landis), s\u00f3n arbres binaris de cerca equilibrats, on tots els \n subarbres compleixen:\n \n - El subarbre esquerre, on hi s\u00f3n les claus m\u00e9s petites que l'arrel.\n \n - El subarbre dret, on hi s\u00f3n les claus m\u00e9s grans que l'arrel.\n \n - fe(T\u2019)=0, fe(T\u2019)=1 \u00f3 fe(T\u2019)=-1; on fe \u00e9s el Factor d'equilibri d'un arbre binari T:\n \n   	fe(T)=profunditat(esq(T))\u2013profunditat(dre(T))
descripcion3=\nUn arbre roig-negre \u00e9 un \u00e1rbre binari de cerca on cada node t\u00e9 un atribut de color \n roig o negre. A m\u00e9s dels requisits imposotos pels arbres binaris de cerca convencionals,\n s'han de cumplir els seg\u00fcents requisits per tindre un arbre roig-negre v\u00e0lid:\n \n - Tot node ha de ser roig o negre.\n \n - L'arrell \u00e9s negra.\n \n - Totes les fulles s\u00f3n negres. \n \n - Tots els fills dels nodes roigs s\u00f3n negres (tamb\u00e9 anomenada "Propietat del roig").\n \n - Cada cam\u00ed que uneix un node amb una fulla descendent, cont\u00e9 el mateix nombre de nodes\n    negres, o b\u00e9 contant els nodes nulls, o no contant-los (el resultat \u00e9s el mateix).\n    Tamb\u00e9 es diu "Propietat del cam\u00ed", i al nombre de nodes negres de cada cam\u00ed, que \u00e9s \n     constant per a tots els cam\u00eds, s'els anomena "Al\u00e7ada negra del arbre", i per tant el \n    cam\u00ed no pot tindre dos nodes roig consecutius.\n \n - El cam\u00ed m\u00e9s llarg des de l'arrel fins una fulla, no \u00e9s m\u00e9s llarg que 2 vegades el\n    cam\u00ed m\u00e9s curt des de l'arrel de l'arbre a una fulla d'aquest arbre. El resultat \u00e9s que \n    aquest arbre est\u00e0 aproximadament balancejat.
descripcion4=\nSi realitzem la operaci\u00f3 d'insertar una CLAU K ambn un VALOR V dins d'un arbre,\n s'introdueix dins del arbre la parella <clau, valor> coressponent a la inserci\u00f3.\n \n POSIBILITATS: \n \n * Si la clau K no existeix al arbre, s'introducir\u00e0 al arbre la parella <clau, valor> \n \n * Si la clau K ja existeix al arbre, s'actualitzar\u00e0 el seu valor.\n \n * Si la clau K t\u00e9 un valor indefinit, es generar\u00e0 un ERROR.
descripcion5=\nSi realitzem la operaci\u00f3 de consultar una CLAU K  d'un arbre; obtindrem el valor de la \nclau. \n \n POSIBILITATS: \n \n * Si la clau K existeix al arbre, es mostrar\u00e0 amb un missatge quin \u00e9s el valor de la clau. \n \n * Si la clau K no existeix al arbre, es generar\u00e0 un ERROR.  
descripcion6=\nSi realitzem l'operaci\u00f3n d'eliminar una CLAU K  d'un arbre; s'eliminar\u00e0 la \nparella <clau, valor>. \n \n POSIBILITATS: \n \n * Si la clau K existeix al arbre, s'eliminar\u00e0 i s'actualizar\u00e0 la estructura del arbre. \n \n * Si la clau K no existeix al arbre, es generar\u00e0 un ERROR.  