# To change this template, choose Tools | Templates
# and open the template in the editor.
descripcion1=\n Un \u00e1rbol ABC (\u00c1rbol Binario Completo), es un \u00e1rbol que se caracteriza porque todos sus nodos,\n excepto los del \u00faltimo nivel  tienen dos hijos: \n \n - El sub\u00e1rbol izquierdo, donde est\u00e1n ubicadas las claves m\u00e1s peque\u00f1as que la ra\u00edz. \n - El sub\u00e1rbol derecho, donde est\u00e1n ubicadas las claves m\u00e1s grandes que la ra\u00edz.
descripcion2=\n Un \u00e1rbol AVL (Adelson-Velskii y Landis), es un \u00e1rbol binario de b\u00fasqueda, en el que todo\n sub\u00e1rbol cumple: \n \n - El sub\u00e1rbol izquierdo, donde est\u00e1n ubicadas las claves m\u00e1s peque\u00f1as que la ra\u00edz. \n - El sub\u00e1rbol derecho, donde est\u00e1n ubicadas las claves m\u00e1s grandes que la ra\u00edz. \n - fe(T\u2019)=0, fe(T\u2019)=1 \u00f3 fe(T\u2019)=-1; donde fe es el Factor de equilibrio de un \u00e1rbol binario T: \n \n   	fe(T)=profundidad(izq(T))\u2013profundidad(der(T))
descripcion3=\n Un \u00e1rbol rojo-negro es un \u00e1rbol binario de b\u00fasqueda en el que cada nodo tiene un atributo \n de color cuyo valor es rojo o negro. Adem\u00e1s de los requisitos impuestos a los \u00e1rboles \n binarios de b\u00fasqueda convencionales, se deben satisfacer los siguientes para tener un \n \u00e1rbol rojo-negro v\u00e1lido: \n \n - Todo nodo es o bien rojo o bien negro.\n - La ra\u00edz es negra. \n - Todas las hojas son negras (las hojas son los hijos nulos). \n - Los hijos de todo nodo rojo son negros (tambi\u00e9n llamada "Propiedad del rojo").\n - Cada camino simple desde un nodo a una hoja descendiente contiene el mismo n\u00famero de \n    nodos negros, ya sea contando siempre los nodos negros nulos, o bien no cont\u00e1ndolos \n    nunca (el resultado es equivalente). Tambi\u00e9n es llamada "Propiedad del camino", y al \n    n\u00famero de nodos negros de cada camino, que es constante para todos los caminos, se le \n    denomina "Altura negra del \u00e1rbol", y por tanto el c\u00e1mino no puede tener dos rojos seguidos. \n - El camino m\u00e1s largo desde la ra\u00edz hasta una hoja no es m\u00e1s largo que 2 veces el camino \n    m\u00e1s corto desde la ra\u00edz del \u00e1rbol a una hoja en dicho \u00e1rbol. El resultado es que dicho \n    \u00e1rbol est\u00e1 aproximadamente equilibrado.
descripcion4=\n Si realizamos la operaci\u00f3n de insertar una CLAVE K con un VALOR V dentro de un \u00e1rbol, se \n introduce dentro del \u00e1rbol la pareja <clave, valor> corerspondiente a la inserci\u00f3n. \n \n POSIBILIDADES: \n \n * Si la clave K no existe en el \u00e1rbol, se introducir\u00e1 en el \u00e1rbol la pareja <clave, valor> \n \n * Si la clave K ya exista en el \u00e1rbol, se proceder\u00e1 a actualizar su valor. \n \n * Si la clave K tiene un valor indefinido, se generar\u00e1 un ERROR.
descripcion5=\n Si realizamos la operaci\u00f3n de eliminar una CLAVE K  de un \u00e1rbol; se proceder\u00e1 a eliminar la \n pareja <clave, valor>. \n \n POSIBILIDADES: \n \n * Si la clave K existe en el \u00e1rbol, se eliminar\u00e1 y se actualizar\u00e1 la estructura del \u00e1rbol .\n \n * Si la clave K no existe en el \u00e1rbol, se generar\u00e1 un ERROR.  
descripcion6=\n Si realizamos la operaci\u00f3n de consultar una CLAVE K  de un \u00e1rbol; obtendremos el valor de dicha\n clave. \n \n POSIBILIDADES: \n \n * Si la clave K existe en el \u00e1rbol, se indicar\u00e1 por mensaje cu\u00e1l es el valor de dicha clave.\n \n * Si la clave K no existe en el \u00e1rbol, se generar\u00e1 un ERROR.  